Veen_OpenFOAM_Cases-main/Flow_around_cylider/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.0002;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    
    #include "include/probes"
    #include "include/fieldAverage"
    #include "include/forceCoeffs"
    #include "include/forces"
    // #include "include/singleGraph"
    // #include "include/surfaces"
    #includeFunc residuals
    // #includeFunc Q
    // #includeFunc Lambda2
    // #includeFunc vorticity
}


// ************************************************************************* //
