Veen_OpenFOAM_Cases-main/Flow_around_cylider/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(nuTilda)   cellLimited Gauss linear 1;    //fix low mesh quality
    grad(U)         cellLimited Gauss linear 1; 
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss LUST grad(U);
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,R)      Gauss limitedLinear 1;
    div(R)          Gauss linear;
    div(phi,nuTilda) Gauss LUST grad(nuTilda);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected; 
    // default         Gauss linear limited corrected 0.33; 
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes 
{ 
    default         corrected;
    // default         limited corrected 0.33;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
